type ObjType = {
    [key: string]: string
}
export function getDeclination (duration:string){
    const obj:ObjType = {
        1: 'день',
        2: 'дня',
        3: 'дня',
        4: 'дня',
        5: 'дней',
        6: 'дней',
        7: 'дней',
        8: 'дней',
        9: 'дней',
        10:'дней',
        11:'дней',
        12:'дней',
        13:'дней',
        14:'дней',
        15:'дней',
        16:'дней',
        17:'дней',
        18:'дней',
        19:'дней',
        20:'дней',
        21:'день',
        22:'дня',
        23:'дня',
        24:'дня',
        25:'дней',
        26:'дней',
        27:'дней',
        28:'дней',
        29:'дней',
        30:'дней',
    }
    return obj[duration]
}